{"author_id": 254292897413726208, "message_id": 832258143001116712, "author_name": "Archduke", "content": "That service is already getting sold to Project Halo. Really interested to see how that goes out. Ham with his mercs facing all the zergs alone while Asage is gathering the biggest pile of resources in SB."}
{"author_id": 254292897413726208, "message_id": 832258334366236713, "author_name": "Archduke", "content": "Though they decided to move it to safe zone though. Not sure why they'd need mercs to protect something there."}
{"author_id": 254292897413726208, "message_id": 832258477476806676, "author_name": "Archduke", "content": "Asage Fleetworks has been going on about building a Halo type mega station in SB, aiming for it to be the biggest station in the game or something."}
{"author_id": 254292897413726208, "message_id": 832258562981494834, "author_name": "Archduke", "content": "But they've got basically zero PvP factions backing it, meaning it's just a resource dump waiting for someone to take it."}
{"author_id": 254292897413726208, "message_id": 832258916221583410, "author_name": "Archduke", "content": "I don't know anymore. Asage left SB when they left Lodestar and switched their main game to Starship EVO. The Project Halo Discord is still there."}
{"author_id": 254292897413726208, "message_id": 832259000162451527, "author_name": "Archduke", "content": "Just saw this there"}
{"author_id": 254292897413726208, "message_id": 832259691198939196, "author_name": "Archduke", "content": "Yeah. A lot of the pre-EA factions have no idea what they're talking about. Huge ideals and goals, but little experience or numbers to back it up with. Reality hits hard on EA launch."}
{"author_id": 254292897413726208, "message_id": 832259835474739221, "author_name": "Archduke", "content": "I think the best ones I've seen so far is a faction with 1-2 members advertising that their faction will be running the biggest fleet in SB."}
{"author_id": 254292897413726208, "message_id": 832260615015497729, "author_name": "Archduke", "content": "Don't think I remembered to take a pic of the ad. It's probably still there. It doesn't rival this though. Some faction contacted Collective and asked us to write code for a fully automated drone in exchange for making the ship 😂"}
{"author_id": 254292897413726208, "message_id": 832261228604817409, "author_name": "Archduke", "content": "I really get why a lot of groups avoid pre-EA. There's such a huge gab between expectations and reality. Then there's factions that have completely crazy goals like building the biggest station, running the biggest fleet or managing to kill all pirates... the list goes on."}
{"author_id": 254292897413726208, "message_id": 832261828721508352, "author_name": "Archduke", "content": "This. There simply isn't being best in everything, let alone good. You need to focus on some area and excel at it to stand out. Even COL is having great difficulties diversifying and taking care of everything sufficiently well."}
{"author_id": 254292897413726208, "message_id": 832262778202488832, "author_name": "Archduke", "content": "A lot of it is about bringing the right people together and providing them the right kind of environment to work in, give the freedom to do whatever they want to. Each member adds their bit and contributes to the huge tech base we have. Though we are a meritocracy so obvious huge commitment doesn't go unseen. Could say we have managed to get the workaholics to join 😄"}
{"author_id": 254292897413726208, "message_id": 832263581974134859, "author_name": "Archduke", "content": "Couldn't be further from the truth. From day 1 I've pushed it as far away from that as possible. Zero nepotism and people that run it are only the most workaholic ones. The ones that don't bother and stop contributing eventually get dropped out and replaced with the new active members. And no one micromanages everything. Each division is completely autonomous and specialises in its own area. You could basically view it as a federation, multiple highly specialised factions that are banding together under one flag."}
{"author_id": 254292897413726208, "message_id": 832264195331850260, "author_name": "Archduke", "content": "Hive Mind stuff is RP. Little spice on top of it to give it that highly unified look. And gotta say that I wouldn't drop it for anything. That stuff is the highlight for many. Nothing is more fun than flying under Collective S.W.A.R.M. (military branch) in high tech ships in a uniform way using swarm tactics 😄"}
{"author_id": 254292897413726208, "message_id": 832264254417272882, "author_name": "Archduke", "content": "The tournament showed how effective that was. Some say too effective."}
{"author_id": 254292897413726208, "message_id": 832264635704541244, "author_name": "Archduke", "content": "Oh I don't personally control more than the diplo division. R&D, military, logistics, sec, intel etc. are handled by completely separate people and most often I don't have the time to keep track of what they're even up to."}
{"author_id": 254292897413726208, "message_id": 832265552809427006, "author_name": "Archduke", "content": "Believe me, that's something you have to learn even just running the diplo branch. So... much.. work... Substrate basically extends *somewhat* on the same idea, merged with NVA's (then AF) military type structure. Each division in the Directorate basically does their own thing and CoS/Core simply make sure shit doesn't hit the fan and that the division are cooperating properly."}
{"author_id": 254292897413726208, "message_id": 832266162028412969, "author_name": "Archduke", "content": "That's something we've worked hard towards negating in COL and living to the meritocratic principle. If you do your part and put in the effort, you will get to excel and be a bigger part of the faction. We're having a bit of an issue where people don't want to stand out because then they'll get to join the \"fun\" in management 😄"}
{"author_id": 254292897413726208, "message_id": 832266478542913556, "author_name": "Archduke", "content": "It's moving so fast <a:eyeshake:621714034806358026>"}
{"author_id": 254292897413726208, "message_id": 832266773382430757, "author_name": "Archduke", "content": "Oh right. They opened the shops again. SUB should be putting a training ship there soon. Need something that we can mass produce because we keep running out of vouchers."}
