{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "<@&733592888587452436> EA is approaching soon, with that we finally enter the game as a proper faction. The exact plan on the startup will be transmitted thru this chat shortly and after that ill setup an extra channel for all the qna about it. Talk to you all soon <:nomads:812294421731213322>"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "Untill then"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "https://www.youtube.com/watch?v=B-V_j2jfsZk"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "We are starting at station lucky 13"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "<@&733592888587452436> \nEA is approaching fast so in accordance to monke doctrine here is our big battleplan: We will depart from station 13, seeing as we have alot of greenhorns and people that will not play on day 1, its very much possible that we will stay at said station for some time to get everyone onboard. Station 13 is chosen due to location of the station itself and the location that our allies in Concordia have chosen for themselves. \nTry to get up to speed fast, get some credits and mine some ores after doing the tutorial then come back to this discord and import either <@!93299542836912128>  or <@!229986947727228941>  light and cheap starter ships that i will link in <#869340130358476840>  to then explore and mine with. Feel free to sell some ore back to the station marketplace itself but keep some in your inventory. We don't know the exact costs of ores quite yet but we will be building an ore/materials stash station within the dev zone itself. Try to avoid wasting too much time chasing down people as its abit counterproductive but dont shy away from pirating or shooting at others as you see fit. \n\nAny further announcments will be made in this channel, and ill be sending a Discord profile picture overlay of our faction shortly if you feel like representing yourself in VIR colors abit further. Cheers <:nomads:812294421731213322>"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "<@&733592888587452436> feel free to come hang in voice chat"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "<@&733592888587452436> Update: we are going to 16"}
{"author_id": 340725653164916737, "author_name": "Dantian", "content": "<@&733592888587452436> Please post your name in name-library channel to join the corp in game"}
{"author_id": 229986947727228941, "author_name": "Isley", "content": "Hey fellow nomads <:Salute:870776676831854612> \n\nas you know, we are at war with collective and anyone who may help them.\n\nso i created a blueprint that contains one of our light fighters, the **arctic nomad**, and renz's **practice drone**.\nwith this, you can effectively learn how to fly, use and fight in a combat ship.\n\nthis drone will not fight back, but simulate a somewhat near fight, which includes circling your enemy, getting used to fast and slow controls, getting used to different guns, and how to take precise shots to take down your target.\n\nyou can also add different weapons on the fighters hardpoint to see how you handle them and generally just practice.\nyou can also copy the practice drone in case you want to take down 2 or more drones at ones to see how you do against multiple targets. good luck nomads <:Salute:870776676831854612>\n\n**HOW TO INSTALL BLUEPRINT:**\n**go to:**\nmy computer -> local harddrive C (your main harddrive that has the users folder inside) -> users -> \"your name\" -> appdata -> roaming -> starbase -> ssc -> autosave -> ship_blueprints.\n\nname the file, after your latest autosave.\nexample: **ship_213123**\n\nnow go ingame, inside the SSC, open \"file\" in the left top corner, click \"open or manage blueprints\", click on autosaves, and a blank name will appear. this is your file, make sure once opened, that you save it as your own blueprint while inside the SSC.\n\nhttps://cdn.discordapp.com/attachments/821529618598068284/876609552269848646/ship_15155.fbe\nhttps://www.dropbox.com/s/rgyg41dd2e1fah9/arctic%20nomad%20drone%20practice.fbe?dl=0\n\nif you got any questions, just dm me c:"}
{"author_id": 229986947727228941, "author_name": "Isley", "content": "**IMPORTANT NOTES ON THE FIGHTER:**\nonce you spawn the fighter in the SSC (spaceship workshop, orange building), you press F5 to start a simulation.\nthen, you move below the ship, theres a small gap to enter the pilot seat.\nonce in, **PRESS V** to set your keybinds (doesnt matter which, pick any keybind you prefer) and set the following buttons and levers:\n\n```launchmissile+ = shoots missiles.\n\ntransponderactive = activates and deactivates your transponder\n\nrangefinderstate = a small green crosshair line.\n\nmountedweaponfire+ and mountedweaponfire1+ = will shoot your main guns on the outside.\n\nleverminoutput- levermaxoutput+ = your aiming buttons, THEY BOTH NEED TO BE BINDED TO THE SAME KEYBOARD KEY, OR LIKE ME, ON MY RIGHT MOUSE BUTTON. it will slow down your turning speed, thus you can take better precise shots.```"}
{"author_id": 229986947727228941, "author_name": "Isley", "content": "common notes to take while using this ship (you will see similar setups):\n\ninfront of you on the right side on the table, there is a cruise button which will enable either \"toggle\" or \"hold\" if you want to fly forward.\n\ninfront of you on the left side, is a generator button that will basically reduce your fuel consumption when not active.\nwhen active, it will spool up your generators to 100% output giving you greater power management to fire your weapons for a longer period of time.\n\nbehind you, is the hatch button which will let you change out your empty fuel rods and coolant cells.\nnext to it, theres a MSLHATCH, that you need to press, if you wish to open the missile hatches and shoot missiles.\n\nalso press the safety button, behind the cruise button, to disable safety on missiles so they explode on impact with the drone\n\n**common questions:**\n\n\"the missiles dont fire/appear/explode\"\nsolution: make sure the Missilehatches are open, and you stay still while shooting them. any strong turning movement or the like, will make them literally dissapear, that is frozenbytes solution to not shoot your own ship with missiles while launching. they have most accuracy when standing still, you will use them a lot more in the future as well.\n**make sure you also press the safety button, behind the cruise button, to disable safety so they explode on impact with the drone**\n\n\n\"why can i only shoot a few salvos\"\nsolution: probably the generators havent spooled up yet to 100%, it takes some time so make sure to wait a bit.\nalso, make sure you have activated your generator output to 100% with the left button infront of you.\nalso make sure your weapons arent overheated"}
{"author_id": 229986947727228941, "author_name": "Isley", "content": "Sorry for the inconvience, but apparently some of you have issues downloading the practice drone file directly from discord.\nthus i made a dropbox link that will hopefully fix this issue instead. in case it still doesnt work for you, pls notify me\nhttps://www.dropbox.com/s/rgyg41dd2e1fah9/arctic%20nomad%20drone%20practice.fbe?dl=0"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "@everyone Hello again its me, back at pinging you and annoying you. Theres a few things I'd like to talk about\n**1st** We will likely be reworking the structure and ranks for better work of the faction as a whole, this will be rolled out eventually and might help the newer players to orient themselves better\n**2nd** There will be a relations channel coming up, so that all you people that dont care about politics/the official discord can keep track of who our enemies are in particular and more importantly who we are allied with.\n**3rd** I'm going to address the whole Collective thing here, yes we don't exactly like them, but that doesn't mean we shouldn't be the bigger person when it comes to their provocative speaches to fall into them and their arguments over issues that have no relation to us or are fairly irrelevant in the grand scheme of things, its a waste of their time and most imporantly its a waste of **our** time. Also I would like to ask you all to behave, chanting \"collective bad\" is funny sometimes but don't overdo it, it can easily be spinned against us to harm our own reputation and make us look like a bunch of 10 year olds. Do you want to end up like some of them? Thats what I thought. Anyways take care till next time <:nomads:812294421731213322>"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "@everyone We are losing Rythm on the 15th, devs say to keep the bot(s) in the server but im not sure what exactly that means.. Could mean that we are just gonna have to make due with no music bots in VCs <:sadge:869445658803863563> https://rythm.fm/\n\nF reactions to pay respect"}
{"author_id": 326411880539226124, "author_name": "Mito", "content": "<:pepemachete:855240384653295646> gonna go smack the shit out of YouTube Ceo"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "@here peep into <#880751436936380416> incase youre interested in playing SE with us :)"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone who has space engineers? I'm asking as it is apparent we could do with some team ops training and se provides a perfect medium for this. React to this message please."}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "<@&800376010356162611> react if you want to do this event"}
{"author_id": 456226577798135808, "author_name": "Deleted User", "content": "500k entry?"}
{"author_id": 456226577798135808, "author_name": "Deleted User", "content": "<@!333888913431199746> aint we got the other project we gotta save for?"}
{"author_id": 751191418667663402, "author_name": "jac", "content": "Oh god jack"}
{"author_id": 751191418667663402, "author_name": "jac", "content": "What the actual fuck is that pfp"}
{"author_id": 751191418667663402, "author_name": "jac", "content": "It scared the fuck out of me"}
{"author_id": 456226577798135808, "author_name": "Deleted User", "content": "trolled"}
{"author_id": 456226577798135808, "author_name": "Deleted User", "content": "king moonfucker for da nomads"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "@everyone be weary of some sus shit going around, links are fishy and the whole concept is fishy so if you get a friend request just ignore it. Stay safe and thank you <:pepopray:856633377606991872>"}
{"author_id": 882785890613743656, "author_name": "severalofthemoney", "content": "but thats the safest starbase marketplace"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "@here\n<#874364139764584608> removed 🟡 \n<#874364139764584608> restricted to member only/opt in via extra role ⚪ \n<#874364139764584608> left as is 🔵 \nfuck off for pinging me <:feelsguntm:911913070283075654>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Nomads are exploring other games apart from Starbase, given a \"pause in development.\"\nhttps://media.discordapp.net/attachments/723966837091467316/968603252759359528/unknown.png . It is regrettable for us and everyone affected; we had an incredible 2-year run being one being the top PvP group and all of us are sad to see the direction it is taking but will retain great memories of this game and the expansive community.\n\nHowever, we do have solutions:\n-The game night was a success, so we are looking forward to continuing that; Baro seems to be hot on the list as they recently updated the game\n-We are exploring a game called HunterNet that is very similar to space sims we have played in the past. We will be streaming on their server from 7-8 UTC <t:1651086000:t> 6 Hours from this message. Discord: https://discord.gg/AGFDQAPS Some info on the game: https://media.discordapp.net/attachments/963120932854059078/968856419191361606/unknown.png?width=1440&height=172"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone"}
{"author_id": 229986947727228941, "author_name": "Isley", "content": "ping more"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "https://discord.gg/zu8ekVSa?event=974025814775590984\n<@&800376010356162611>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "React if you are available. Let's win this thing! <:nomads:812294421731213322><:boomerpepe:869445659063902270>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone \nYou may have noticed that we have played Risk, a strategic warfare game involving six people trying to take over territories with dice; I know that sounds like a grandpa game, but with the monkes, it's hella fun; we've not had the amount of concentration and competitiveness from any other <#927675273502142474> game so far.\n\nHowever, there are a few limits to Risk. Firstly it is for only 6 players, and secondly, there is not much variation in playstyle once everyone has 'mastered' the game (we've seen 2.5-hour games be reduced to 30-45 mins) **Polytopia** solves these problems with different 'tribes' with abilities and up to **15 players** (The reason why I'm opening it to more people) and maintaining a similar **simplicity** as risk making it easy to pick up whilst offering more **depth** so a game will last longer and be less predictable. \n\nIt's on **50% off** right now at around 5 euros on steam for **6 more hours**, and I'd expect to get a month of play out of it as once we have done this internal test, I'd like to open it to the broader community. I'm planning to start playing on **Sunday**.\n\nMonke promises there will be boonanas thrown, screams and betrayals. 🙏 \n\nhttps://store.steampowered.com/app/874390/The_Battle_of_Polytopia/"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "https://media.discordapp.net/attachments/723966837091467316/835636784477241374/nomads.gif"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "monke has been archiving shit, so if stuff has disappeared you haven't been demoted, it's just unused so invisible to everyone but admins"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Faraway looks to have been hooked be careful lads"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "hecked"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "<:pepocry:869445659323944990>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "https://store.steampowered.com/app/242760/The_Forest/ guys buy forest if you want to play with us as it is currently 75% of till the 8th. It will likely be our next <#927675273502142474> game"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone It has begun. Zomboid server is now open internally.\nPreview: https://www.youtube.com/watch?v=zjQiwrYCmrI\nWorkshop for mods used on server: https://steamcommunity.com/sharedfiles/filedetails/?id=2708567768\nGame: https://store.steampowered.com/app/108600/Project_Zomboid/\nWe will play at <t:1664647200:F> tonight 🏕️"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Ok lads managed to make a python bot that uses OpenAI GPT-3 API thing (https://chat.openai.com/chat) to talk to you so you don't have to sign up, just type !ai in bot channel with your question. If you want me to implement some features just ask"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "I'll work on improving it's internet connection tomorrow <:Copium:849563380879851561>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Please don't ask the bot redacted stuff (use common sense) or I will  blacklist you as I don't want to be responsible for your actions. I want to keep providing the bot but can't if people search stuff that will compromise me. Please let me know if anyone goes against my wishes. You can ask questions at your own discretion with the link above.\n\nSource code can be found here, and yes I am logging you:\n\nhttps://discord.com/channels/711625884771287151/855116288305135626/1049472063812939857"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "https://discord.com/channels/711625884771287151/927675273502142474/1049722016275640421\nValheim mistlands is here."}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "||DOUDBLE SPEED Z!!!!||"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone Hunternet - game night <t:1671303600:F> in  #🟧-VC-game-night\n\nMost of you know that our future plans for Nomads currently reside with Hunternet: `https://discord.gg/hunternet`, `https://hunternet.gg`. A space MMO with a heavy focus on PvP, pilot skills and zone control that a dozen of us played around with early this year and really enjoyed. To prepare for this game, <@220959033895550976> has Offered to host a \"hunternight\" where we will offer a \"friendly introductory session\" to get us \"up to speed\".\n\nMany keys have been given out by <@220959033895550976> , and we have a few spare ones for people who have been active in the community until now (we only have a minimal supply).  \nIf you don't meet these criteria and want to play with us here is the Patreon: `https://www.patreon.com/hunternet`\n\nI'm looking forward to seeing you there! 🫡"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "@everyone Happy new year guys much good health and fun in 2023 for everyone :)))"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "Merry Christmas"}
{"author_id": 140183856970989568, "author_name": "fabo", "content": "<:PepePointLaugh:1057356540983652365>"}
{"author_id": 336218223735209992, "author_name": "Tiiny", "content": "Merry Chrysler to everyone"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "why can yall type here reeeee"}
{"author_id": 220959033895550976, "author_name": "Zehtuka", "content": "Amen"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "voltssssss"}
{"author_id": 220959033895550976, "author_name": "Zehtuka", "content": "Where’s our desk busy <@333888913431199746>"}
{"author_id": 140183856970989568, "author_name": "fabo", "content": "<:PepePointLaugh:1057356540983652365>"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "enjoy my cake"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "merry Jesus"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "!ai is <@!333888913431199746> gay"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "he js"}
{"author_id": 140183856970989568, "author_name": "fabo", "content": "Giev cake you bastard <:reEEEEEEE:869445658728357928>"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "come take it yourself"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "is this your new years celebration"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "Cake"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "ues"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "yes"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "i ran out of booze"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "Are you alone"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "i have a friend over"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "are you guys ganna sex"}
{"author_id": 140183856970989568, "author_name": "fabo", "content": "<:ded:852026218886201355>"}
{"author_id": 227129167106277376, "author_name": "Viribus Ego Vis", "content": "\"A friend\""}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "o is it a women"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "<@!261972352470876160> you have a women at ur house?"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "there may be a person of the female gender inside here somewhere <:pepe_braindead:1033733529449799700>"}
{"author_id": 140183856970989568, "author_name": "fabo", "content": "Bruh, if they sex he wont be bothered posting cake in this channel <:happyderp:795523933808885760>"}
{"author_id": 140183856970989568, "author_name": "fabo", "content": "She would already be eating his cake"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "also merry christmas to all the <@&871437288633139281> s"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "im half expecting mito to based react as well but knowing him hes probably in some gutter at a roadside 50km outside the first town"}
{"author_id": 298431874227896329, "author_name": "FFT", "content": "Announcement: there is an unopened bottle with your name on it in your vicinity"}
{"author_id": 326411880539226124, "author_name": "Mito", "content": "Fuck you I'm at a vegan club"}
{"author_id": 261972352470876160, "author_name": "TurnIP", "content": "same thing <:KEKWait:1048704594181627944>"}
{"author_id": 326411880539226124, "author_name": "Mito", "content": "<:kekw:869445658367656017>"}
{"author_id": 326411880539226124, "author_name": "Mito", "content": "Nice to know you guys have such high expectations of me <:pepelaugh:853190773604089857>"}
{"author_id": 326411880539226124, "author_name": "Mito", "content": "Happy new year <:based:854343428502061086>"}
{"author_id": 382590993725128705, "author_name": "Faraway", "content": "https://youtu.be/xg0miHv6L0o"}
{"author_id": 298431874227896329, "author_name": "FFT", "content": "Weak"}
{"author_id": 298431874227896329, "author_name": "FFT", "content": "Where's the animal based alcohol"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Ooh ekk, wadda miss, me was celebrating 2023?"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Terraria server up (doing testing today):\n\nterraria IP: nomadst.ddns.net\npassword is the usual"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "To connect:\n\n1) Get terraria on steam\n2) Get tModLoader on steam\nhttps://store.steampowered.com/app/1281930/tModLoader/\n3) subscribe to these mods: https://discord.com/channels/711625884771287151/927675273502142474/1062805081491255296\n4) go back to menu>multiplayer>join via ip>create character>use IP: nomadst.ddns.net>port: 7777 >password is usual (message me if you don't know it)\n5) your in"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone Hunternet - Combat Racing,  Invasion game mode <t:1675623600:F> in https://discord.gg/Futvt8F8\n\n<@220959033895550976> Has offered to do more flight training in preparation for our move to Hunternet. This will involve advanced tutorials for harder-to-grasp features, Combat Racing and Invasion game mode. Since this is in the Hunternet discord and will likely attract a few veterans, we must maintain a good reputation, so be conscious of your behaviour. I look forward to seeing you there!\n\nIf you are not familiar with Hunternet, see: https://discord.com/channels/711625884771287151/869356747247218788/1053298632683700336"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "https://discord.com/channels/711625884771287151/723966837091467316/1071431675466227746 - 'Advanced tutorials' as mentioned above"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone final reminder hunternet event <t:1675623600:R>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone \nAfter much debate, name-calling and ~~retardation~~ <:MonkeOOO:871556381814190170> I've decided it's easier to vote on whether we should change the tag VIR and to what?\n\n1️⃣  = VIR\n2️⃣  = NOM\n3️⃣  = MAD\n4️⃣  = NMD\n5️⃣  = NMA\n6️⃣  = MON\n\nSee the main discussion here (recommended):\nhttps://discord.com/channels/711625884771287151/1075065775909515384/1075065775909515384\n\nONE VOTE PER PERSON"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "@everyone NOM wins please change all your nicknames to include the tag [NOM] on all appropriate servers. Sorry og VIR lads it had to be done, we may not retain our tag but we still retain our reputation <:pepopray:856633377606991872>"}
{"author_id": 333888913431199746, "author_name": "Mr Volts", "content": "Fastest way to do this is in User settings (bottom left)>server profiles>choose a server. I will chase you up in following days https://cdn.discordapp.com/attachments/367743597237501952/1075767890206269561/image.png"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "<@&733592888587452436> EA is approaching soon, with that we finally enter the game as a proper faction. The exact plan on the startup will be transmitted thru this chat shortly and after that ill setup an extra channel for all the qna about it. Talk to you all soon <:nomads:812294421731213322>"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "Untill then"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "https://www.youtube.com/watch?v=B-V_j2jfsZk"}
{"author": {"id": 333888913431199746, "name": "Mr Volts"}, "content": "We are starting at station lucky 13"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "<@&733592888587452436> \nEA is approaching fast so in accordance to monke doctrine here is our big battleplan: We will depart from station 13, seeing as we have alot of greenhorns and people that will not play on day 1, its very much possible that we will stay at said station for some time to get everyone onboard. Station 13 is chosen due to location of the station itself and the location that our allies in Concordia have chosen for themselves. \nTry to get up to speed fast, get some credits and mine some ores after doing the tutorial then come back to this discord and import either <@!93299542836912128>  or <@!229986947727228941>  light and cheap starter ships that i will link in <#869340130358476840>  to then explore and mine with. Feel free to sell some ore back to the station marketplace itself but keep some in your inventory. We don't know the exact costs of ores quite yet but we will be building an ore/materials stash station within the dev zone itself. Try to avoid wasting too much time chasing down people as its abit counterproductive but dont shy away from pirating or shooting at others as you see fit. \n\nAny further announcments will be made in this channel, and ill be sending a Discord profile picture overlay of our faction shortly if you feel like representing yourself in VIR colors abit further. Cheers <:nomads:812294421731213322>"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "<@&733592888587452436> feel free to come hang in voice chat"}
{"author": {"id": 333888913431199746, "name": "Mr Volts"}, "content": "<@&733592888587452436> Update: we are going to 16"}
{"author": {"id": 340725653164916737, "name": "Dantian"}, "content": "<@&733592888587452436> Please post your name in name-library channel to join the corp in game"}
{"author": {"id": 229986947727228941, "name": "Isley"}, "content": "Hey fellow nomads <:Salute:870776676831854612> \n\nas you know, we are at war with collective and anyone who may help them.\n\nso i created a blueprint that contains one of our light fighters, the **arctic nomad**, and renz's **practice drone**.\nwith this, you can effectively learn how to fly, use and fight in a combat ship.\n\nthis drone will not fight back, but simulate a somewhat near fight, which includes circling your enemy, getting used to fast and slow controls, getting used to different guns, and how to take precise shots to take down your target.\n\nyou can also add different weapons on the fighters hardpoint to see how you handle them and generally just practice.\nyou can also copy the practice drone in case you want to take down 2 or more drones at ones to see how you do against multiple targets. good luck nomads <:Salute:870776676831854612>\n\n**HOW TO INSTALL BLUEPRINT:**\n**go to:**\nmy computer -> local harddrive C (your main harddrive that has the users folder inside) -> users -> \"your name\" -> appdata -> roaming -> starbase -> ssc -> autosave -> ship_blueprints.\n\nname the file, after your latest autosave.\nexample: **ship_213123**\n\nnow go ingame, inside the SSC, open \"file\" in the left top corner, click \"open or manage blueprints\", click on autosaves, and a blank name will appear. this is your file, make sure once opened, that you save it as your own blueprint while inside the SSC.\n\nhttps://cdn.discordapp.com/attachments/821529618598068284/876609552269848646/ship_15155.fbe\nhttps://www.dropbox.com/s/rgyg41dd2e1fah9/arctic%20nomad%20drone%20practice.fbe?dl=0\n\nif you got any questions, just dm me c:"}
{"author": {"id": 229986947727228941, "name": "Isley"}, "content": "**IMPORTANT NOTES ON THE FIGHTER:**\nonce you spawn the fighter in the SSC (spaceship workshop, orange building), you press F5 to start a simulation.\nthen, you move below the ship, theres a small gap to enter the pilot seat.\nonce in, **PRESS V** to set your keybinds (doesnt matter which, pick any keybind you prefer) and set the following buttons and levers:\n\n```launchmissile+ = shoots missiles.\n\ntransponderactive = activates and deactivates your transponder\n\nrangefinderstate = a small green crosshair line.\n\nmountedweaponfire+ and mountedweaponfire1+ = will shoot your main guns on the outside.\n\nleverminoutput- levermaxoutput+ = your aiming buttons, THEY BOTH NEED TO BE BINDED TO THE SAME KEYBOARD KEY, OR LIKE ME, ON MY RIGHT MOUSE BUTTON. it will slow down your turning speed, thus you can take better precise shots.```"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "<@&733592888587452436> EA is approaching soon, with that we finally enter the game as a proper faction. The exact plan on the startup will be transmitted thru this chat shortly and after that ill setup an extra channel for all the qna about it. Talk to you all soon <:nomads:812294421731213322>"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "Untill then"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "https://www.youtube.com/watch?v=B-V_j2jfsZk"}
{"author": {"id": 333888913431199746, "name": "Mr Volts"}, "content": "We are starting at station lucky 13"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "<@&733592888587452436> \nEA is approaching fast so in accordance to monke doctrine here is our big battleplan: We will depart from station 13, seeing as we have alot of greenhorns and people that will not play on day 1, its very much possible that we will stay at said station for some time to get everyone onboard. Station 13 is chosen due to location of the station itself and the location that our allies in Concordia have chosen for themselves. \nTry to get up to speed fast, get some credits and mine some ores after doing the tutorial then come back to this discord and import either <@!93299542836912128>  or <@!229986947727228941>  light and cheap starter ships that i will link in <#869340130358476840>  to then explore and mine with. Feel free to sell some ore back to the station marketplace itself but keep some in your inventory. We don't know the exact costs of ores quite yet but we will be building an ore/materials stash station within the dev zone itself. Try to avoid wasting too much time chasing down people as its abit counterproductive but dont shy away from pirating or shooting at others as you see fit. \n\nAny further announcments will be made in this channel, and ill be sending a Discord profile picture overlay of our faction shortly if you feel like representing yourself in VIR colors abit further. Cheers <:nomads:812294421731213322>"}
{"author": {"id": 261972352470876160, "name": "TurnIP"}, "content": "<@&733592888587452436> feel free to come hang in voice chat"}
{"author": {"id": 333888913431199746, "name": "Mr Volts"}, "content": "<@&733592888587452436> Update: we are going to 16"}
{"author": {"id": 340725653164916737, "name": "Dantian"}, "content": "<@&733592888587452436> Please post your name in name-library channel to join the corp in game"}
{"author": {"id": 229986947727228941, "name": "Isley"}, "content": "Hey fellow nomads <:Salute:870776676831854612> \n\nas you know, we are at war with collective and anyone who may help them.\n\nso i created a blueprint that contains one of our light fighters, the **arctic nomad**, and renz's **practice drone**.\nwith this, you can effectively learn how to fly, use and fight in a combat ship.\n\nthis drone will not fight back, but simulate a somewhat near fight, which includes circling your enemy, getting used to fast and slow controls, getting used to different guns, and how to take precise shots to take down your target.\n\nyou can also add different weapons on the fighters hardpoint to see how you handle them and generally just practice.\nyou can also copy the practice drone in case you want to take down 2 or more drones at ones to see how you do against multiple targets. good luck nomads <:Salute:870776676831854612>\n\n**HOW TO INSTALL BLUEPRINT:**\n**go to:**\nmy computer -> local harddrive C (your main harddrive that has the users folder inside) -> users -> \"your name\" -> appdata -> roaming -> starbase -> ssc -> autosave -> ship_blueprints.\n\nname the file, after your latest autosave.\nexample: **ship_213123**\n\nnow go ingame, inside the SSC, open \"file\" in the left top corner, click \"open or manage blueprints\", click on autosaves, and a blank name will appear. this is your file, make sure once opened, that you save it as your own blueprint while inside the SSC.\n\nhttps://cdn.discordapp.com/attachments/821529618598068284/876609552269848646/ship_15155.fbe\nhttps://www.dropbox.com/s/rgyg41dd2e1fah9/arctic%20nomad%20drone%20practice.fbe?dl=0\n\nif you got any questions, just dm me c:"}
{"author": {"id": 229986947727228941, "name": "Isley"}, "content": "**IMPORTANT NOTES ON THE FIGHTER:**\nonce you spawn the fighter in the SSC (spaceship workshop, orange building), you press F5 to start a simulation.\nthen, you move below the ship, theres a small gap to enter the pilot seat.\nonce in, **PRESS V** to set your keybinds (doesnt matter which, pick any keybind you prefer) and set the following buttons and levers:\n\n```launchmissile+ = shoots missiles.\n\ntransponderactive = activates and deactivates your transponder\n\nrangefinderstate = a small green crosshair line.\n\nmountedweaponfire+ and mountedweaponfire1+ = will shoot your main guns on the outside.\n\nleverminoutput- levermaxoutput+ = your aiming buttons, THEY BOTH NEED TO BE BINDED TO THE SAME KEYBOARD KEY, OR LIKE ME, ON MY RIGHT MOUSE BUTTON. it will slow down your turning speed, thus you can take better precise shots.```"}
